# cf. https://en.wikipedia.org/wiki/Baudot_code#ITA2

# Letter の表
ITA2TABLE_LS = {
    "00000": "[Null]",
    "00010": "[Carriage return]",
    "01000": "[Line feed]",
    "00100": " ",
    "11101": "Q",
    "11001": "W",
    "10000": "E",
    "01010": "R",
    "00001": "T",
    "10101": "Y",
    "11100": "U",
    "01100": "I",
    "00011": "O",
    "01101": "P",
    "11000": "A",
    "10100": "S",
    "10010": "D",
    "10110": "F",
    "01011": "G",
    "00101": "H",
    "11010": "J",
    "11110": "K",
    "01001": "L",
    "10001": "Z",
    "10111": "X",
    "01110": "C",
    "01111": "V",
    "10011": "B",
    "00110": "N",
    "00111": "M",
    "11011": "[FS]",
    "11111": "[LS]",
}

# Figure の表
ITA2TABLE_FS = {
    "00000": "[Null]",
    "00010": "[Carriage return]",
    "01000": "[Line feed]",
    "00100": " ",
    "11101": "1",
    "11001": "2",
    "10000": "3",
    "01010": "4",
    "00001": "5",
    "10101": "6",
    "11100": "7",
    "01100": "8",
    "00011": "9",
    "01101": "0",
    "11000": "–",
    "10100": "'",
    "10010": "[WRU?]",
    "10110": "!",
    "01011": "&",
    "00101": "£",
    "11010": "[Bell]",
    "11110": "(",
    "01001": ")",
    "10001": "+",
    "10111": "/",
    "01110": ":",
    "01111": "=",
    "10011": "?",
    "00110": ",",
    "00111": ".",
    "11011": "[FS]",
    "11111": "[LS]",
}


def parse_ita2(bit_chunks):
    # 初期状態を Letter にする
    mode = '[LS]'
    for chunk in bit_chunks:
        if mode == '[LS]':
            # Letter の状態のときは Letter の表を見る
            char = ITA2TABLE_LS[chunk]
        else:
            # Figure の状態のときは Figure の表を見る
            char = ITA2TABLE_FS[chunk]

        if char == '[FS]' or char == '[LS]':
            # モード切り替えのコードが来たらモードを切り替える
            mode = char
        else:
            # それ以外であれば文字とchunkを出力する
            yield (char, chunk)
